Revit.Elements.StructuralFraming.ByCurveLevelUpVectorAndType(Autodesk.DesignScript.Geometry.Curve,Revit.Elements.Level,Autodesk.DesignScript.Geometry.Vector,Revit.Elements.StructuralType,Revit.Elements.FamilySymbol)
Create a Revit Structural Member - a special FamilyInstance
curve: The curve path for the structural member
upVector: The up vector for the element - this is required to determine the orientation of the element
level: The level on which the member should appear
structuralType: The type of the structural element - a beam, column, etc
structuralFamilySymbol: The FamilySymbol representing the structural type
Returns: